Repository: 84000/data-translation-memory
Catalog: toh129-v4.tmx
Source language: bo
Languages: en

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལས་ངེས་པར་བྱུང་བ། ཐབས་མཁས་པ་ཆེན་པོས་རྣམ་པར་རྩེན་པ།
en: They find emancipation through the perfection of insight and are embraced by great skillful means.

source: སངས་རྒྱས་དང་ཆོས་དང་དགེ་འདུན་ཡིད་ལ་བྱེད་པ་དང་མ་བྲལ་བ།
en: They are never without consideration for the Buddha, the Dharma, and the Saṅgha.

source: སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པའི་མཆོག་གི་ཕ་རོལ་ཏུ་སོན་པ་སྟེ།
en: They have attained supreme mastery in ripening beings.

source: སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་དེ་བཞིན་གཤེགས་པའི་བྱིན་གྱི་རླབས་ཀྱིས་བྱིན་གྱིས་བརླབས་པ་དག་གོ།
en: They have the capacities to ripen beings due to the transformative power of the Thus-Gone One.

source: །འཇམ་དཔལ་འདི་ལྟ་སྟེ་དཔེར་ན།
en: “Mañjuśrī, consider this analogy.

source: སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་ཀྱི་སེམས་ཅན་དེ་དག་སེམས་ཅན་རེ་རེ་ནས། འཛམ་བུའི་གླིང་ལ་དབང་བའི་རྒྱལ་པོར་གྱུར་ཏེ།དེ་དག་ཐམས་ཅད་ཀྱིས་ཚིག་འདི་སྐད་ཅེས་
en: Imagine if as many beings as there are atoms in all the world systems in the great trichiliocosm all became kings with dominion over Jambudvīpa and made this declaration:

source: བདག་ཅག་གིས་ཐེག་པ་ཆེན་པོ་གང་ལེན་པ་འཛིན་པ་དང་། ཀློག་པ་དང་། ཀུན་ཆུབ་པར་བྱེད་པ་དེའི་ཤ་ལས་ཉི་མ་རེ་རེ་ཞིང་ཡང་སྲང་ལྔ་ལྔ་སེན་མོས་གཅད་པར་བྱ་སྟེ། དེ་ཚུལ་དེ་ལྟ་བུས་སྲོག་དང་དབྲལ་ལོ་ཞེས་སྨྲ་བ་ལ། འཇམ་དཔལ་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་དེ་སྐད་སྨྲ་བས་མི་སྐྲག་མི་དངང་དངང་བར་མི་འགྱུར་ཏེ།
en: ‘Every day we shall tear with our own nails five ounces of flesh from the bodies of those who adopt, uphold, recite, or master the Great Vehicle, and so we shall rob them of their lives.’ Were bodhisattvas to be addressed in this way, Mañjuśrī, they would not be afraid and would not panic.

source: ཐ་ན་སྐྲག་པའི་སེམས་ཀྱང་མི་སྐྱེད། ཞུམ་པ་མེད། གོད་པ་མེད། ཐེ་ཚོམ་མེད་ལ། ཕྱིར་ཞིང་ཆོས་ཡོངས་སུ་གཟུང་བ་ལ་བརྩོན་ཏེ།
en: They would not give rise to even a single thought of fear but would remain undeterred, without despair, and without doubts, and they would apply themselves with even greater dedication for the sake of the Dharma.

source: ཀློག་པ་དང་ཁ་ཏོན་བྱེད་པ་ལ་བརྩོན་པར་འགྱུར་བའི་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི། འཇམ་དཔལ། སེམས་དཔའ་བ། སྦྱིན་པ་ལ་དཔའ་བ། ཚུལ་ཁྲིམས་ལ་དཔའ་བ། བཟོད་པ་ལ་དཔའ་བ། བརྩོན་འགྲུས་ལ་དཔའ་བ། བསམ་གཏན་ལ་དཔའ་བ། ཤེས་རབ་ལ་དཔའ་བ། ཏིང་ངེ་འཛིན་ལ་དཔའ་བ་ཞེས་བྱའོ།
en: These bodhisattvas, who would be diligent in both reading and chanting the teaching, would, Mañjuśrī, be described as heroic persons with regard to generosity, discipline, patience, diligence, concentration, insight, and absorption.

source: །འཇམ་དཔལ་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་དེ་གསོད་པའི་མི་དེ་དག་ལ་མི་ཁྲོ་ཞིང་། ཐ་བ་དང་ཞེ་སྡང་གི་སེམས་མི་སྐྱེད་ན། འཇམ་དཔལ་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ཚངས་པ་དང་མཚུངས་པ། དབང་པོ་དང་མཚུངས་པ། ལྷུན་པོ་དང་མཚུངས་པ།
en: Mañjuśrī, if those bodhisattvas could avoid becoming irate, hateful, and angry toward those who try to kill them, then, Mañjuśrī, those bodhisattvas would be the same as Brahmā, Indra, and Mount Meru.

source: མི་གཡོ་བ། སྙིང་རྗེ་དང་ལྡན་པ། བྱམས་པ་ལ་གནས་པ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་བསམ་པ་གསོ་བ་ལ་མོས་པ།
en: They would be imperturbable, compassionate, loving, and interested in fulfilling the wishes of all beings.

source: ཕྱིར་མི་ལྡོག་པའི་སྤྱོད་ཡུལ་བ།
en: Their experience would be non-regressing.

source: སེམས་ས་དང་མཚུངས་པ། སེམས་ཆུ་དང་མཚུངས་པ། སེམས་མེ་དང་མཚུངས་པ། སེམས་ནམ་མཁའ་དང་མཚུངས་པ་ཞེས་བྱ་སྟེ།
en: Their minds would be like earth, like water, like fire, and like the sky.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་དང་། ཐ་བ་སེལ་བའི་ཕྱིར་ཞུགས་པའོ།
en: They would work to eradicate the desire, anger, delusion, and hate of all beings.

source: །འཇམ་དཔལ་གང་གིས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱི་སངས་རྒྱས་རྣམས་ལས་སངས་རྒྱས་རེ་རེ་ལ་ཡང་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་ནོར་བུ་རིན་པོ་ཆེ་དབང་གི་རྒྱལ་པོས་རབ་ཏུ་བཀང་སྟེ། དབུལ་བ་ཕུལ་ལ། དེ་ལྟར་དབུལ་བས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱི་བསྐལ་པར་དབུལ་བ་ཕུལ་བ་བས།
en: “Mañjuśrī, some bodhisattvas might fill as many buddha realms as there are grains of sand in the Ganges with the jewels known as enthralling kings and offer these individually to as many buddhas as there are grains of sand in the Ganges, continuing to make this offering for as many eons as there are grains of sand in the Ganges.

source: འཇམ་དཔལ་བྱང་ཆུབ་སེམས་དཔའ་གཞན་གང་གིས་རྣམ་པ་འདི་ལྟ་བུའི་ཆོས་འདི་ཐོས་ནས། ཕྱོགས་གཅིག་ཏུ་སོང་སྟེ། འདི་ལྟར་སེམས་ཀྱིས་མངོན་པར་རྟོག་ཅིང་འདི་ལྟ་བུའི་ཆོས་ལ་བསླབ་པར་བྱའོ་ཞེས་སློབ་པར་འདོད་ན།
en: Compare to them, Mañjuśrī, some other bodhisattvas who might hear a teaching such as this, go their own ways, contemplate the teaching, and form the wish to practice, thinking, ‘I must practice this teaching!’

source: དེས་མ་བསླབས་སུ་ཟིན་ཀྱང་བསོད་ནམས་ཆེས་མང་དུ་སྐྱེད་དེ། བྱང་ཆུབ་སེམས་དཔའ་ནོར་བུ་རིན་པོ་ཆེ་དབང་གི་རྒྱལ་པོ་སྦྱིན་པའི་བསོད་ནམས་ནི་དེ་ལྟ་མ་ཡིན་ནོ།།དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: The merit of these latter bodhisattvas, even if they have not practiced yet, would still be greater than the merit of the former bodhisattvas who offered the enthralling king jewels. And why?

source: དེའི་སེམས་བསྐྱེད་མ་ཐག་པ་དེས་ཆོས་བཞི་ཡོངས་སུ་འཛིན་པའི་ཕྱིར་ཏེ།
en: Because as soon as they engender that attitude, they hold four qualities.

source: བཞི་གང་ཞེ་ན།
en: What are these four qualities? (1)

source: བྱམས་པ་ཡོངས་སུ་བཟུང་བ་ཡིན།
en: They are filled with love. (2)

source: འདས་པ་དང་མ་འོངས་པ་དང་ད་ལྟར་བྱུང་བའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་བཀའ་དང་མི་འགལ་བར་བྱས་པ་ཡིན།
en: They do not contradict the teachings of the blessed buddhas of the past, present, and future. (3)

source: དེ་ནན་ཏན་སྙིང་པོར་བྱེད་པ་ཡིན།
en: They diligently make use of these teachings. (4)

source: མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་ཡིན་ཏེ།
en: They will quickly awaken to unsurpassed and perfect buddhahood.

source: ཆོས་བཞི་པོ་དེ་དག་ཡོངས་སུ་འཛིན་ཏོ།
en: These are the four qualities that they uphold.

source: །གཞན་ཡང་ཆོས་བཞི་ཡོངས་སུ་འཛིན་ཏེ།
en: They also uphold four other qualities.

source: དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སྒྲིབ་པ་མེད་པའི་བློའི་རྣམ་པར་ཐར་པ་ཡོངས་སུ་འཛིན་པ་སྟེ་བཞི་པོ་དེ་དག་གོ།
en: They uphold (1) the ten powers of a thus-gone one, (2) the four types of fearlessness, (3) the four types of correct understanding, and (4) the freedom of a stainless mind. Such are these four qualities.

source: །འཇམ་དཔལ་ཆོས་བཞི་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཞེས་བྱ་སྟེ།
en: “Mañjuśrī, there are also four qualities that, when practiced, make one a bodhisattva great being.

source: དུས་སུ་སྦྱིན་པ་དང་། གཡོ་མེད་ཅིང་སྒྱུ་མེད་པ་དང་། ལྷག་པའི་བསམ་པས་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་དང་མི་འབྲལ་བ་དང་། སེམས་དང་པོ་བསྐྱེད་པའི་བྱང་ཆུབ་སེམས་དཔའ་ལ་ཡང་ཤིན་ཏུ་གུས་པ་སྟེ་ཆོས་བཞི་པོ་
en: They are (1) extending timely generosity, (2) being free from deceit and pretense, (3) not taking breaks from engendering the mind of awakening with an altruistic attitude, and (4) being deeply respectful toward even a bodhisattva who has just begun engendering the mind of awakening.

source: དེ་དག་དང་ལྡན་ན།བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཞེས་བྱའོ།
en: When practicing these four qualities, one is called a bodhisattva great being.

source: །འཇམ་དཔལ་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་ལ་རྒྱལ་པོའམ། བློན་པོ་ཆེན་པོ་གང་ཞིག་འདི་སྐད་ཅེས་གལ་ཏེ་ཁྱོད་སེམས་ཅན་གཅིག་གི་དོན་དུ་དགེ་བའི་རྩ་བ་གཅིག་ཡང་དག་པར་བསྒྲུབས་ཏེ། ཐ་ན་དུད་འགྲོའི་སྐྱེ་གནས་སུ་སོང་བ་ལ་ཟན་ཆང་གཅིག་ཙམ་སྦྱིན་ཞིང་བསྒྲུབ་ན་ཡང་དེའི་ཕྱིར་ངས་ཁྱོད་ཀྱི་ཤ་སེན་མོས་བཏོགས་ཏེ་མེད་པར་བྱའོ་ཞེས་ཟེར་ལ།
en: Mañjuśrī, suppose a king or a minister threatens bodhisattvas, saying, ‘If you carry out even a single root of virtue for the sake of another being, even something as insignificant as feeding a single meal to an animal, I will personally destroy you by tearing the flesh off your bones with my nails.’

source: གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་དེ་སྐད་ཟེར་བ་ལ་མི་སྐྲག་མི་དངང་དངང་བར་མི་འགྱུར་ཞིང་འཇིགས་པ་མེད་ཀྱི།
en: In that case, they should not be afraid of that threat.Instead, while remaining undeterred and free from worry,

source: འདི་ལྟར་སེམས་སྐྱེད་དེ། གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱི་ལུས་ཀྱི་ཤ་སེན་མོས་བཅད་དེ་བོར་ཡང་བདག་སྤྲོ་བར་བྱའི་བདག་སེམས་ཅན་གཅིག་གི་ཕྱིར་ཡང་ཇི་ཙམ་དུ་ཆུང་ངུ་ན་ཡང་དགེ་བའི་རྩ་བ་གཅིག་ཡང་དག་པར་མི་བསྒྲུབ་ཏུ་མི་གཏང་ངོ་སྙམ་ནས་སེམས་བསྐྱེད་པ་གཅིག་པོ་དེས་བྱང་ཆུབ་སེམས་དཔའ་དེས་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཀྱི་རྡུལ་སྙེད་ཀྱི་གཏན་པ་མེད་པའི་མཆོད་སྦྱིན་ཟིལ་གྱིས་གནོན་ཏོ།
en: they should tell themselves, ‘Even if he were to use his nails to tear off the flesh from as many bodies as there are grains of sand in the Ganges, I would never miss the chance to accomplish a root of virtue, no matter how small, even if it only benefits and helps a single being.’ By that very attitude the bodhisattvas will then surpass even an unstinting offering of everything there is in all the world systems in the ten directions.

source: །ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཀྱི་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་ཀྱི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྦྱིན་པ་ལས་བྱུང་བའི་དགེ་བའི་རྩ་བ་རྣམས་ཀྱང་ཟིལ་གྱིས་གནོན་ཏེ།
en: It would even surpass those roots of virtue that arise from the generosity of as many bodhisattvas as there are atoms in all the world systems in the ten directions,

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་འགྱུར་རོ།
en: and it would cause the progress of those bodhisattvas toward unsurpassed and perfect buddhahood to be irreversible.

source: །གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱི་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་མྱོང་བར་འགྱུར་རོ།
en: It would make them universal monarchs for as many times as there are grains of sand in the Ganges.

source: །དེ་བཞིན་དུ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱི་བརྒྱ་བྱིན་དང་ཚངས་པ་འཐོབ་ཅིང་མྱོང་བར་འགྱུར་རོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Likewise, it would cause them to become Brahmā and Śakra as many times as there are grains of sand in the Ganges. And why?

source: འཇམ་དཔལ་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་སེམས་ཅན་རྣམས་ལ་སྙིང་རྗེ་བསྐྱེད་ན་དེ་སྙིང་རྗེ་དང་ལྡན་པའི་དགེ་བའི་རྩ་བ་དེས་ཆོས་བཞི་ཡོངས་སུ་འཛིན་ཏེ།
en: “Mañjuśrī, bodhisattvas who develop compassion for others come to uphold four qualities thanks to the roots of virtue of such compassion.

source: བརྟན་པའི་སེམས་ཡོངས་སུ་འཛིན་པ་དང་། ཁོང་ཁྲོ་བ་མེད་པའི་སེམས་དང་། སྙིང་རྗེ་ཆེན་པོ་ཡོངས་སུ་འཛིན་པ་དང་། ཕྱིན་ཅི་ལོག་གི་ཤེས་པ་སྤངས་ནས་ཕྱིན་ཅི་མ་ལོག་པའི་ཡེ་ཤེས་འཐོབ་པའོ།
en: They will master (1) a stable mind, (2) a mind without anger, (3) a compassionate mind, and (4) they will attain unmistaken wisdom by abandoning mistaken cognition.

source: ཚུལ་ཁྲིམས་ཕུན་སུམ་ཚོགས་པ་མཆོག་ཡོངས་སུ་འཛིན་ཏེ། ཚུལ་ཁྲིམས་ཕུན་སུམ་ཚོགས་པ་མཆོག་དེ་དང་ལྡན་པས་བྱང་ཆུབ་སེམས་དཔའ་ལྷ་གཞན་ལ་རྟོན་པར་མི་འགྱུར་བ་དང་།
en: They uphold a foremost and perfect discipline, and because they are in possession of this foremost and perfect discipline, they do not have to rely on any gods. (2)

source: དྲན་པ་ཕུན་སུམ་ཚོགས་པ་མཆོག་འཐོབ་སྟེ།
en: They attain supreme and perfect mindfulness and,

source: དྲན་པ་ཕུན་སུམ་ཚོགས་པ་མཆོག་དེ་དང་ལྡན་པས་བྱང་ཆུབ་སེམས་དཔའ་སྐྱེ་བར་སྐྱེ་ན། ཚེ་རབས་དྲན་པར་འགྱུར་བ་དང་།
en: because they possess such supreme and perfect mindfulness, they become mindful of feelings. (3)

source: དགེ་བའི་བཤེས་གཉེན་ཕུན་སུམ་ཚོགས་པ་མཆོག་ཡོངས་སུ་འཛིན་ཏེ།དགེ་བའི་བཤེས་གཉེན་ཕུན་སུམ་ཚོགས་པ་མཆོག་དེ་དང་ལྡན་པས་བྱང་ཆུབ་སེམས་དཔའ་སངས་རྒྱས་འབྱུང་བ་དང་འབྲལ་བར་མི་འགྱུར།
en: They come to follow a supreme and perfect spiritual friend, and because they have such a supreme and perfect spiritual friend, those bodhisattvas never stray from becoming buddhas. (4)

source: སངས་རྒྱས་འབྱུང་བ་དང་མི་འབྲལ་བའི་སངས་རྒྱས་ཀྱི་ཞིང་དུ་སྐྱེ་བར་འགྱུར།
en: They will be born in buddha realms in which there is always the presence of a buddha.

source: གལ་ཏེ་སངས་རྒྱས་ནི་མ་བྱུང་ལ་འཛམ་བུའི་གླིང་དུ་སྐྱེས་ན་ཡང་སྐྱེས་བུ་དམ་པར་འགྱུར། འཛམ་བུའི་གླིང་ན་སྦྱིན་པའི་གནས་གཅིག་པུར་འགྱུར།
en: Even if there should not be any buddha present, they will be born in Jambudvīpa as holy beings who become recipients of generosity from those who live in that continent.

source: རང་སངས་རྒྱས་དང་གཞན་མངོན་པར་ཤེས་པ་ལྔ་དང་ལྡན་པ་དང་འདོད་པའི་འདོད་ཆགས་དང་བྲལ་བ་དེ་དག་མགུ་བར་བྱེད་པར་འགྱུར།
en: As solitary buddhas or those with the five types of superknowledge, they will be free from the attachments of desire, and they will make beings there happy.

source: དེ་དག་མགུ་བར་བྱས་ནས།བསོད་སྙོམས་འབུལ་བར་འགྱུར་བ་དང་། ལྷ་རྣམས་ཀྱིས་ཡོངས་སུ་བཟུང་བར་འགྱུར་ཏེ།
en: As they bring people happiness, they will offer them alms, while the gods will protect them.

source: ནམ་བག་མེད་པར་གྱུར་པ་དེའི་ཚེ་ཡང་གནས་གཙང་མའི་རིས་ཀྱི་ལྷའི་བུ་རྣམས་ཀྱིས་སྐུལ་བར་འགྱུར།
en: If they should ever become careless, the gods from the pure realms will encourage them in the right direction.

source: བསྐུལ་ནས་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་བརྩོན་འགྲུས་རྩོམ་པར་འགྱུར། དེའི་དྲན་པ་ཆུད་མི་ཟ་བར་འགྱུར།
en: Having been encouraged in this way, they will then be eager to practice for unsurpassed and perfect buddhahood, without losing sight of that goal.

source: བྱང་ཆུབ་ཡང་དག་པར་འགྲུབ་པའི་རྒྱུར་བརྩོན་འགྲུས་རྩོམ་པར་འགྱུར་རོ།
en: “Thus, they will diligently practice the causes of awakening.

source: །འཇམ་དཔལ་བྱང་ཆུབ་སེམས་དཔའ་དེ་སེམས་བསྐྱེད་པ་དེས་རྣམ་པར་དག་པར་བྱེད་པའི་ཆོས་ལྔ་ཡོངས་སུ་འཛིན་ཏེ།
en: Mañjuśrī, when those bodhisattvas engender the mind of awakening, they come to uphold five purifying qualities.

source: ལྔ་གང་ཞེ་ན།
en: What are these five?

source: ཚུལ་ཁྲིམས་རྣམ་པར་དག་པ་ཡོངས་སུ་འཛིན་པ་དང་། ལུས་རྣམ་པར་དག་པ་དང་མཚན་ཕུན་སུམ་ཚོགས་པ་འཐོབ་པ་རྣམ་པར་དག་པ་དང་དགེ་བའི་རྩ་བ་སྦྱངས་པ་རྣམ་པར་དག་པ་དང་།
en: They attain (1) pure discipline, (2) pure body, (3) pure attainment of perfect physical marks, and (5) pure training in roots of virtue, and

source: སངས་རྒྱས་ལ་རྟེན། ཆོས་ལ་རྟེན། དགེ་འདུན་ལ་རྟེན། བྱང་ཆུབ་སེམས་དཔའ་ལ་རྟེན། བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་ལ་རྟེན་པ་ཡོངས་སུ་འཛིན་པ་ཡིན་ཏེ།
en: they come to rely on the Buddha, on the Dharma, on the Saṅgha, on the bodhisattvas, and on engendering the mind of awakening.

source: འཇམ་དཔལ་རྣམ་པར་དག་པར་བྱེད་པའི་ཆོས་དེ་དག་ཡོངས་སུ་འཛིན་པར་འགྱུར་རོ།
en: Mañjuśrī, these are the five purifying qualities that they come to uphold.

source: །འཇམ་དཔལ་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གང་ལ་ལས་འཛམ་བུའི་གླིང་པའི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྲོག་བཅད་དེ། དེ་དག་གི་བདོག་པ་ཐམས་ཅད་ཕྲོགས་པ་བས།
en: “Mañjuśrī, suppose some noble son or daughter was to kill all the beings in Jambudvīpa and rob them of all their possessions.

source: འཇམ་དཔལ་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་གང་གཞན་ཞིག་གིས་བྱང་ཆུབ་སེམས་དཔའ་དགེ་བའི་རྩ་བ་གཅིག་གི་སེམས་བསྐྱེད་པ། ཐ་ན་དུད་འགྲོའི་སྐྱེ་གནས་སུ་སོང་བ་ལ་ཟན་ཆང་གཅིག་བྱིན་པ་དང་ལྡན་པའི་དགེ་བའི་རྩ་བའི་བར་ཆད་བྱས་ན། དེ་དེ་བས་ཆེས་སྡིག་པ་གྲངས་མེད་པར་སྐྱེད་དོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Mañjuśrī, if you compare that act to the act of another noble son or daughter who created obstacles for a bodhisattva’s single virtuous intention, be it no more than blocking the roots of virtue of giving a single morsel of food to an animal, then this latter act would create immeasurably more negativity than the former. And why?

source: སངས་རྒྱས་འབྱུང་བ་སྐྱེད་པའི་དགེ་བའི་རྩ་བའི་བར་ཆད་བྱེད་པར་གནས་པའི་ཕྱིར་རོ།
en: Because it would create obstacles for the roots of virtue that cause a buddha to appear.

source: །འཇམ་དཔལ་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་གང་ལ་ལ་མདོ་སྡེ་དཀོན་མཆོག་སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་སྐྱེད་པ་རྣམ་པ་འདི་ལྟ་བུ་འདི་ལ་མོས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ལ་སྨོད་ཅིང་བསྔགས་པ་མ་ཡིན་པ་བརྗོད། འདུམ་པར་མི་བྱེད། དགེ་བའི་རྩ་བ་དང་བྲལ་བར་བྱེད་དེ། དགེ་བའི་རྩ་བ་ལ་མོས་པ་དང་བྲལ་བར་བྱེད་ཅིང་བར་ཆད་བྱེད་ན།
en: “Mañjuśrī, noble sons or daughters may create obstacles by criticizing, slandering, and opposing a bodhisattva who is devoted to a precious discourse like this, which has come forth from the wisdom of the Buddha, or they may cause the bodhisattva to give up such roots of virtue or lose interest in them.

source: དེ་མི་དགེ་བའི་རྩ་བ་བསགས་པ་དེས་སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་རྣམས་སུ་སྐྱེ་བར་འགྱུར་རོ།
en: In such cases, by accumulating such roots of nonvirtue, those persons will be born among the beings in the great hells.

source: །དེ་དེར་སྐྱེས་ནས་ལུས་དཔག་ཚད་ལྔ་བརྒྱ་པ་འགྲུབ་བོ།
en: Once born there, those persons will obtain bodies five hundred leagues tall.

source: །ལུས་དེ་ལ་ཡང་མགོ་ལྔ་བརྒྱར་འགྱུར་རོ། །མགོ་བོ་རེ་རེ་ལ་ཡང་ལྕེ་ལྔ་བརྒྱ་ལྔ་བརྒྱར་འགྱུར་རོ།
en: On those bodies there will be five hundred heads, each one of them with five hundred tongues.

source: །ལྕེ་རེ་རེ་ལ་ཡང་ཐོང་གཤོལ་ལྔ་བརྒྱ་ལྔ་བརྒྱས་རྨོ་བར་འགྱུར་ཏེ།
en: On each of these tongues there will be five hundred plows plowing.

source: བསྐལ་པ་ཇི་སྙེད་ཅིག་གིས་བྱང་ཆུབ་སེམས་དཔའ་དེ་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་དེ་སྙེད་ཀྱི་བསྐལ་པར་སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་རྣམས་སུ་སྐྱེས་ནས་སྡུག་བསྔལ་ཆེན་པོ་མྱོང་བར་འགྱུར་རོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: “For as many eons as it takes that bodhisattva to awaken to perfect buddhahood, those hell beings will have to endure great suffering in the great hells. And why?

source: དེ་སངས་རྒྱས་འབྱུང་བའི་བར་ཆད་བྱ་བར་ཞུགས་པའི་ཕྱིར་རོ།
en: Because they created obstacles for the manifestation of a buddha.

source: །གང་སངས་རྒྱས་འབྱུང་བའི་བར་ཆད་བྱ་བའི་ཕྱིར་ཞུགས་པ་དེ་སངས་རྒྱས་ཀྱི་རིགས་གཅོད་པའི་ཕྱིར་ཞུགས་པའོ།
en: Those who create obstacles for the manifestation of a buddha are cutting themselves off from the family of the Buddha.

source: །ཆོས་ཀྱི་རིགས་གཅོད་པའི་ཕྱིར་ཞུགས་པའོ།
en: They are cutting themselves off from the family of the Dharma.

source: །དགེ་འདུན་གྱི་རིགས་གཅོད་པའི་ཕྱིར་ཞུགས་པའོ།
en: They are cutting themselves off from the family of the Saṅgha.

source: །དེ་ལྷའི་རིགས་གཅོད་པའི་ཕྱིར་ཞུགས་པའོ།
en: They are cutting themselves off from the family of the gods.

source: །དེ་ཚངས་པ་ཐམས་ཅད་ཀྱི་རིགས་གཅོད་པའི་ཕྱིར་ཞུགས་པའོ།
en: They are cutting themselves off from the family of all Brahmā gods.

source: །དེ་མིའི་འཇིག་རྟེན་གཅོད་པའི་ཕྱིར་ཞུགས་པའོ།
en: They are cutting themselves off from the world of humans.

source: །དེ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་བདེ་བར་སྦྱར་བ་ཐམས་ཅད་གཅོད་པའི་ཕྱིར་ཞུགས་པའོ།
en: They are cutting themselves off from the happiness of all beings.

source: །འཇམ་དཔལ་གང་ལ་ལ་བྱང་ཆུབ་སེམས་དཔའི་དགེ་བའི་རྩ་བ་གཅོད་པའི་ཕྱིར་འཇུག་པ་དེ་ལ་རྣམ་པ་དེ་ལྟ་བུའི་སྡུག་བསྔལ་ཆེན་པོ་སྐྱེ་བར་འགྱུར་རོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: “Mañjuśrī, those who attempt to disrupt the roots of virtue of a bodhisattva will experience great sufferings such as these. And why?

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ཐམས་ཅད་ནི་དགེ་བའི་རྩ་བའི་ཚོགས་ཐམས་ཅད་ཀྱིས་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ།
en: Because all bodhisattvas awaken to perfect buddhahood through such accumulations of roots of virtue.

source: །མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་ཀྱང་སེམས་ཅན་རྣམས་ལ་ཆོས་ཀྱི་འཁོར་ལོ་རབ་ཏུ་སྐོར་རོ།།ཆོས་ཐོས་ནས་ཀྱང་
en: Once they awaken, they turn the wheel of Dharma for others who, once they hear the Dharma,

source: རྒྱུན་དུ་ཞུགས་པར་འགྱུར། ལན་ཅིག་ཕྱིར་འོང་བ་དང་། ཕྱིར་མི་འོང་བ་དང་། དགྲ་བཅོམ་པར་འགྱུར། རང་རྒྱལ་བར་འགྱུར། རྒྱལ་པོ་ཆེན་པོ་བཞིར་འགྱུར། སུམ་ཅུ་རྩ་གསུམ་དང་འཐབ་བྲལ་དང་། དགའ་ལྡན་དང་འཕྲུལ་དགའ་དང་། གཞན་འཕྲུལ་དབང་བྱེད་ཀྱི་ལྷར་འགྱུར།
en: become stream enterers, once-returners, non-returners, worthy ones, and solitary buddhas, as well as gods in the Heaven of the Four Great Kings, the Heaven of the Thirty-Three, the Heaven Free from Strife, the Heaven of Joy, the Heaven of Delighting in Emanations, and the Heaven of Making Use of Others’ Emanations.

source: ཟླ་བ་དང་ཉི་མར་འགྱུར།
en: Such beings also become the moon and the sun;

source: སྐར་མ་དང་རྒྱུ་སྐར་དང་། ཚོགས་དང་ཚོགས་ཀྱི་བདག་པོ་ཆེན་པོར་འགྱུར།
en: they become the great Gaṇapati of the groups of stars and planets.

source: དྲག་པོ་དང་དྲག་པོ་ཆེན་པོར་འགྱུར།
en: They become Rudra and Great Rudra.

source: སངས་རྒྱས་ལས་བརྟེན་ཏེ། ཚངས་པར་འགྱུར། ཚངས་པ་ཆེན་པོར་འགྱུར། ཚངས་པའི་མདུན་ན་འདོན་དུ་འགྱུར། འོད་ཆུང་དང་ཚད་མེད་འོད་དང་། འོད་གསལ་དང་དགེ་ཆུང་དང་། ཚད་མེད་དགེ་དང་། དགེ་རྒྱས་དང་སྤྲིན་མེད་དང་། བསོད་ནམས་སྐྱེས་དང་། འབྲས་བུ་ཆེ་དང་། མི་ཆེ་དང་མི་གདུང་དང་། གྱ་ནོམ་སྣང་དང་ཤིན་ཏུ་མཐོང་དང་། འོག་མིན་གྱི་ལྷ་རྣམས་སུ་འགྱུར།
en: It is in dependence on the Buddha that there appear the gods in the heavens of Brahmā, Great Brahmā, High Priests of Brahmā, Limited Light, and Limitless Light, as well as the Luminous Heaven, Heaven of Limited Virtue, Heaven of Limitless Virtue, Heaven of Perfected Virtue, Cloudless Heaven, Heaven of Increased Merit, Heaven of Great Fruition, Unlofty Heaven, Heaven of No Hardship, Sublime Heaven, Gorgeous Heaven, and the Highest Heaven.

source: སངས་རྒྱས་ལས་བརྟེན་ཏེ་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོར་འགྱུར། སྟོབས་ཀྱི་འཁོར་ལོས་སྒྱུར་བར་འགྱུར། རྒྱལ་ཕྲན་དུ་འགྱུར། དྲང་སྲོང་མངོན་པར་ཤེས་པ་ལྔ་ཅན་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར།
en: It is in dependence on the Buddha that beings are born in the world as universal monarchs, powerful universal monarchs, and minor kings and as sages with the five types of superknowledge.

source: སངས་རྒྱས་ལས་བརྟེན་ཏེ་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་འཇིག་རྟེན་དུ་སྣང་བར་འགྱུར།
en: It is in dependence on the Buddha that the path of the ten virtues appears in the world.

source: སངས་རྒྱས་ལས་བརྟེན་ཏེ་མིའི་འཇིག་རྟེན་འབྱུང་བར་འགྱུར།
en: It is in dependence on the Buddha that beings are born in the world of humans.

source: སངས་རྒྱས་ལས་བརྟེན་ཏེ་སྐྱིད་པ་དང་། ནོར་ཆེ་བ་དང་མཛོད་མང་བ་དང་། ལུས་ཤིན་ཏུ་འཇམ་པར་འགྱུར། གླང་པོ་ཆེས་འགྲོ་བར་འགྱུར། རྟས་འགྲོ་བ་དང་། དཔུང་བུ་ཆུང་གིས་འགྲོ་བར་འགྱུར་རོ།
en: It is in dependence on the Buddha that beings come to have happiness and great wealth, plentiful treasuries, and very fine bodies and that they can travel by elephants, by horses, and with infantry.

source: །འཇམ་དཔལ་བྱང་ཆུབ་སེམས་དཔའ་གང་ལ་ལ་གཞན་གྱི་ཁྱིམ་རྣམས་སུ་བྱང་ཆུབ་སེམས་དཔའ་ལ་ཕྲག་དོག་དང་། སེར་སྣ་བྱེད་ན་དེས་དེའི་ཚེ་གཞི་དེ་ལས་འཇིགས་པ་ཆེན་པོ་གསུམ་ཤེས་པར་བྱ་སྟེ།
en: “Mañjuśrī, when a bodhisattva visits other people’s homes, those who create jealousy or stinginess toward that bodhisattva should know that there are three great dangers that occur on such grounds.

source: གསུམ་གང་ཞེ་ན།
en: What are those three?

source: སེམས་ཅན་དམྱལ་བར་སྐྱེ་བའི་འཇིགས་པ་དང་། དམུས་ལོང་གི་འཇིགས་པ་དང་། ཡུལ་མཐའ་འཁོབ་ཏུ་སྐྱེ་བའི་འཇིགས་པ་དང་།
en: They are the danger of taking birth in hell, the danger of being born blind, and the danger of being born in the borderlands.

source: །འཇམ་དཔལ་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔས་བསོད་སྙོམས་བླངས་ཏེ། རིད་པ་དང་ཕོངས་པ་དང་སྤྲང་པོ་དང་། སློང་བ་རྣམས་ལ་བགོས་ཏེ་བྱིན་ན་དེ་དགེ་བའི་རྩ་བ་དེས་ཚེ་བརྗེས་ནས་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་རྫུ་འཕྲུལ་ཆེན་པོ་དང་ལྡན་པར་འགྱུར་རོ།
en: Mañjuśrī, if bodhisattvas receive alms and share them with those who starve, the poor, the needy, and the destitute, then that root of virtue will ensure that, as they pass to the next life, they will be born as universal monarchs with great miraculous abilities.

source: །འཇམ་དཔལ་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་ཁྱིམ་པ་ལ་ཆོས་སྟོན་ཅིང་སྙིང་རྗེ་བས་དོན་དུ་འདོད། ཕན་པར་འདོད། སེམས་ཅན་དེ་དག་ལ་བདེ་བ་དང་། གྲུབ་པར་འདོད་ཀྱི་རྙེད་པ་དང་། བཀུར་སྟི་དོན་དུ་མི་གཉེར་ན་དེ་དགེ་བའི་རྩ་བ་དེས་ཤེས་རབ་རྣོ་བར་འགྱུར་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་རྫུ་འཕྲུལ་ཆེན་པོ་དང་ལྡན་པར་འགྱུར།
en: Mañjuśrī, if bodhisattvas teach the Dharma to some householders and, motivated by compassion, aspire for their well-being and benefit, hoping that the listeners may find happiness and success without themselves being concerned with profit or honor, then that root of virtue will sharpen their insight and cause them to become universal monarchs with great miraculous abilities.

source: བརྒྱ་བྱིན་རྫུ་འཕྲུལ་ཆེན་པོ་དང་ལྡན་པར་འགྱུར།
en: They will become Śakra with great miraculous abilities.

source: ཚངས་པ་རྫུ་འཕྲུལ་ཆེན་པོ་དང་ལྡན་པར་འགྱུར།
en: They will become Brahmā with great miraculous abilities.

source: །འཇམ་དཔལ་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་སྡུག་བསྔལ་བའི་སེམས་ཅན་མཐོང་ན་སྙིང་རྗེ་སྐྱེད་ཅིང་། བདེ་བའི་སེམས་ཅན་མཐོང་ན་མཆོག་ཏུ་དགའ་བ་སྐྱེད་ན་དེ་ཚེ་བརྗེས་ནས་དགེ་བའི་རྩ་བ་དེས་ལུས་གསེར་གྱི་མདོག་ཅན་དུ་འགྱུར་རོ།།
en: Mañjuśrī, if bodhisattvas feel compassion when seeing beings who suffer and feel exhilarated when seeing beings who are happy, then, as they pass to the next life, that root of virtue will cause their bodies to be the color of gold.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་གང་དུ་འཕགས་པའི་ལམ་བརྗོད་པར་འགྱུར།
en: Then Mañjuśrī Kumārabhūta asked the Blessed One, “Blessed One, with regard to what is the path of the noble ones explained?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། འདུ་བྱེད་ཡོད་པ་ལ་འཕགས་པའི་ལམ་བརྗོད་པར་འགྱུར་རོ།
en: The Blessed One said, “The path of the noble ones is explained with regard to the existence of conditioning.
